SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_txf.h
/**************************************************************************//**
 * @file
 * @brief EFR32FG25 TXF register and bit field definitions
 ******************************************************************************
 * # License
 * <b>Copyright 2022 Silicon Laboratories, Inc. www.silabs.com</b>
 ******************************************************************************
 *
 * SPDX-License-Identifier: Zlib
 *
 * The licensor of this software is Silicon Laboratories Inc.
 *
 * This software is provided 'as-is', without any express or implied
 * warranty. In no event will the authors be held liable for any damages
 * arising from the use of this software.
 *
 * Permission is granted to anyone to use this software for any purpose,
 * including commercial applications, and to alter it and redistribute it
 * freely, subject to the following restrictions:
 *
 * 1. The origin of this software must not be misrepresented; you must not
 *    claim that you wrote the original software. If you use this software
 *    in a product, an acknowledgment in the product documentation would be
 *    appreciated but is not required.
 * 2. Altered source versions must be plainly marked as such, and must not be
 *    misrepresented as being the original software.
 * 3. This notice may not be removed or altered from any source distribution.
 *
 *****************************************************************************/
#ifndef EFR32FG25_TXF_H
#define EFR32FG25_TXF_H
#define TXF_HAS_SET_CLEAR

/**************************************************************************//**
* @addtogroup Parts
* @{
******************************************************************************/
/**************************************************************************//**
 * @defgroup EFR32FG25_TXF TXF
 * @{
 * @brief EFR32FG25 TXF Register Declaration.
 *****************************************************************************/

/** TXF TXFIT Register Group Declaration. */
typedef struct {
  __IOM uint32_t ITCTRL;                             /**< New Register                                       */
  __IOM uint32_t DATEIT;                             /**< New Register                                       */
  __IM uint32_t  ITSIG;                              /**< New Register                                       */
} TXF_TXFIT_TypeDef;

/** TXF Register Declaration. */
typedef struct {
  __IM uint32_t     IPVERSION;                  /**< IP Version ID                                      */
  __IOM uint32_t    EN;                         /**< Module Enable                                      */
  __IOM uint32_t    SWRST;                      /**< Software Reset                                     */
  __IOM uint32_t    CONNECT;                    /**< New Register                                       */
  __IOM uint32_t    DISCLK;                     /**< Diablle clk_per                                    */
  uint32_t          RESERVED0[3U];              /**< Reserved for future use                            */
  __IOM uint32_t    FIFOIN;                     /**< New Register                                       */
  uint32_t          RESERVED1[7U];              /**< Reserved for future use                            */
  uint32_t          RESERVED2[1U];              /**< Reserved for future use                            */
  uint32_t          RESERVED3[23U];             /**< Reserved for future use                            */
  uint32_t          RESERVED4[1U];              /**< Reserved for future use                            */
  uint32_t          RESERVED5[7U];              /**< Reserved for future use                            */
  uint32_t          RESERVED6[1U];              /**< Reserved for future use                            */
  uint32_t          RESERVED7[79U];             /**< Reserved for future use                            */
  __IOM uint32_t    CTRL;                       /**< New Register                                       */
  __IM uint32_t     DATE;                       /**< New Register                                       */
  __IOM uint32_t    IF;                         /**< New Register                                       */
  __IOM uint32_t    IEN;                        /**< New Register                                       */
  __IOM uint32_t    FRAMELENGTH;                /**< New Register                                       */
  TXF_TXFIT_TypeDef TXFIT[6U];                  /**<                                                    */
  uint32_t          RESERVED8[873U];            /**< Reserved for future use                            */
  __IM uint32_t     IPVERSION_SET;              /**< IP Version ID                                      */
  __IOM uint32_t    EN_SET;                     /**< Module Enable                                      */
  __IOM uint32_t    SWRST_SET;                  /**< Software Reset                                     */
  __IOM uint32_t    CONNECT_SET;                /**< New Register                                       */
  __IOM uint32_t    DISCLK_SET;                 /**< Diablle clk_per                                    */
  uint32_t          RESERVED9[3U];              /**< Reserved for future use                            */
  __IOM uint32_t    FIFOIN_SET;                 /**< New Register                                       */
  uint32_t          RESERVED10[7U];             /**< Reserved for future use                            */
  uint32_t          RESERVED11[1U];             /**< Reserved for future use                            */
  uint32_t          RESERVED12[23U];            /**< Reserved for future use                            */
  uint32_t          RESERVED13[1U];             /**< Reserved for future use                            */
  uint32_t          RESERVED14[7U];             /**< Reserved for future use                            */
  uint32_t          RESERVED15[1U];             /**< Reserved for future use                            */
  uint32_t          RESERVED16[79U];            /**< Reserved for future use                            */
  __IOM uint32_t    CTRL_SET;                   /**< New Register                                       */
  __IM uint32_t     DATE_SET;                   /**< New Register                                       */
  __IOM uint32_t    IF_SET;                     /**< New Register                                       */
  __IOM uint32_t    IEN_SET;                    /**< New Register                                       */
  __IOM uint32_t    FRAMELENGTH_SET;            /**< New Register                                       */
  TXF_TXFIT_TypeDef TXFIT_SET[6U];              /**<                                                    */
  uint32_t          RESERVED17[873U];           /**< Reserved for future use                            */
  __IM uint32_t     IPVERSION_CLR;              /**< IP Version ID                                      */
  __IOM uint32_t    EN_CLR;                     /**< Module Enable                                      */
  __IOM uint32_t    SWRST_CLR;                  /**< Software Reset                                     */
  __IOM uint32_t    CONNECT_CLR;                /**< New Register                                       */
  __IOM uint32_t    DISCLK_CLR;                 /**< Diablle clk_per                                    */
  uint32_t          RESERVED18[3U];             /**< Reserved for future use                            */
  __IOM uint32_t    FIFOIN_CLR;                 /**< New Register                                       */
  uint32_t          RESERVED19[7U];             /**< Reserved for future use                            */
  uint32_t          RESERVED20[1U];             /**< Reserved for future use                            */
  uint32_t          RESERVED21[23U];            /**< Reserved for future use                            */
  uint32_t          RESERVED22[1U];             /**< Reserved for future use                            */
  uint32_t          RESERVED23[7U];             /**< Reserved for future use                            */
  uint32_t          RESERVED24[1U];             /**< Reserved for future use                            */
  uint32_t          RESERVED25[79U];            /**< Reserved for future use                            */
  __IOM uint32_t    CTRL_CLR;                   /**< New Register                                       */
  __IM uint32_t     DATE_CLR;                   /**< New Register                                       */
  __IOM uint32_t    IF_CLR;                     /**< New Register                                       */
  __IOM uint32_t    IEN_CLR;                    /**< New Register                                       */
  __IOM uint32_t    FRAMELENGTH_CLR;            /**< New Register                                       */
  TXF_TXFIT_TypeDef TXFIT_CLR[6U];              /**<                                                    */
  uint32_t          RESERVED26[873U];           /**< Reserved for future use                            */
  __IM uint32_t     IPVERSION_TGL;              /**< IP Version ID                                      */
  __IOM uint32_t    EN_TGL;                     /**< Module Enable                                      */
  __IOM uint32_t    SWRST_TGL;                  /**< Software Reset                                     */
  __IOM uint32_t    CONNECT_TGL;                /**< New Register                                       */
  __IOM uint32_t    DISCLK_TGL;                 /**< Diablle clk_per                                    */
  uint32_t          RESERVED27[3U];             /**< Reserved for future use                            */
  __IOM uint32_t    FIFOIN_TGL;                 /**< New Register                                       */
  uint32_t          RESERVED28[7U];             /**< Reserved for future use                            */
  uint32_t          RESERVED29[1U];             /**< Reserved for future use                            */
  uint32_t          RESERVED30[23U];            /**< Reserved for future use                            */
  uint32_t          RESERVED31[1U];             /**< Reserved for future use                            */
  uint32_t          RESERVED32[7U];             /**< Reserved for future use                            */
  uint32_t          RESERVED33[1U];             /**< Reserved for future use                            */
  uint32_t          RESERVED34[79U];            /**< Reserved for future use                            */
  __IOM uint32_t    CTRL_TGL;                   /**< New Register                                       */
  __IM uint32_t     DATE_TGL;                   /**< New Register                                       */
  __IOM uint32_t    IF_TGL;                     /**< New Register                                       */
  __IOM uint32_t    IEN_TGL;                    /**< New Register                                       */
  __IOM uint32_t    FRAMELENGTH_TGL;            /**< New Register                                       */
  TXF_TXFIT_TypeDef TXFIT_TGL[6U];              /**<                                                    */
} TXF_TypeDef;
/** @} End of group EFR32FG25_TXF */

/**************************************************************************//**
 * @addtogroup EFR32FG25_TXF
 * @{
 * @defgroup EFR32FG25_TXF_BitFields TXF Bit Fields
 * @{
 *****************************************************************************/

/* Bit fields for TXF IPVERSION */
#define _TXF_IPVERSION_RESETVALUE               0x00000001UL                            /**< Default value for TXF_IPVERSION             */
#define _TXF_IPVERSION_MASK                     0xFFFFFFFFUL                            /**< Mask for TXF_IPVERSION                      */
#define _TXF_IPVERSION_IPVERSION_SHIFT          0                                       /**< Shift value for TXF_IPVERSION               */
#define _TXF_IPVERSION_IPVERSION_MASK           0xFFFFFFFFUL                            /**< Bit mask for TXF_IPVERSION                  */
#define _TXF_IPVERSION_IPVERSION_DEFAULT        0x00000001UL                            /**< Mode DEFAULT for TXF_IPVERSION              */
#define TXF_IPVERSION_IPVERSION_DEFAULT         (_TXF_IPVERSION_IPVERSION_DEFAULT << 0) /**< Shifted mode DEFAULT for TXF_IPVERSION      */

