SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_txf.h
/* Bit fields for TXF EN */
#define _TXF_EN_RESETVALUE                      0x00000000UL                            /**< Default value for TXF_EN                    */
#define _TXF_EN_MASK                            0x00000003UL                            /**< Mask for TXF_EN                             */
#define TXF_EN_EN                               (0x1UL << 0)                            /**< Module Enable                               */
#define _TXF_EN_EN_SHIFT                        0                                       /**< Shift value for TXF_EN                      */
#define _TXF_EN_EN_MASK                         0x1UL                                   /**< Bit mask for TXF_EN                         */
#define _TXF_EN_EN_DEFAULT                      0x00000000UL                            /**< Mode DEFAULT for TXF_EN                     */
#define TXF_EN_EN_DEFAULT                       (_TXF_EN_EN_DEFAULT << 0)               /**< Shifted mode DEFAULT for TXF_EN             */
#define TXF_EN_DISABLING                        (0x1UL << 1)                            /**< Disablement Busy Status                     */
#define _TXF_EN_DISABLING_SHIFT                 1                                       /**< Shift value for TXF_DISABLING               */
#define _TXF_EN_DISABLING_MASK                  0x2UL                                   /**< Bit mask for TXF_DISABLING                  */
#define _TXF_EN_DISABLING_DEFAULT               0x00000000UL                            /**< Mode DEFAULT for TXF_EN                     */
#define TXF_EN_DISABLING_DEFAULT                (_TXF_EN_DISABLING_DEFAULT << 1)        /**< Shifted mode DEFAULT for TXF_EN             */

/* Bit fields for TXF SWRST */
#define _TXF_SWRST_RESETVALUE                   0x00000000UL                            /**< Default value for TXF_SWRST                 */
#define _TXF_SWRST_MASK                         0x00000003UL                            /**< Mask for TXF_SWRST                          */
#define TXF_SWRST_SWRST                         (0x1UL << 0)                            /**< Software Reset Command                      */
#define _TXF_SWRST_SWRST_SHIFT                  0                                       /**< Shift value for TXF_SWRST                   */
#define _TXF_SWRST_SWRST_MASK                   0x1UL                                   /**< Bit mask for TXF_SWRST                      */
#define _TXF_SWRST_SWRST_DEFAULT                0x00000000UL                            /**< Mode DEFAULT for TXF_SWRST                  */
#define TXF_SWRST_SWRST_DEFAULT                 (_TXF_SWRST_SWRST_DEFAULT << 0)         /**< Shifted mode DEFAULT for TXF_SWRST          */
#define TXF_SWRST_RESETTING                     (0x1UL << 1)                            /**< Software Reset Busy Status                  */
#define _TXF_SWRST_RESETTING_SHIFT              1                                       /**< Shift value for TXF_RESETTING               */
#define _TXF_SWRST_RESETTING_MASK               0x2UL                                   /**< Bit mask for TXF_RESETTING                  */
#define _TXF_SWRST_RESETTING_DEFAULT            0x00000000UL                            /**< Mode DEFAULT for TXF_SWRST                  */
#define TXF_SWRST_RESETTING_DEFAULT             (_TXF_SWRST_RESETTING_DEFAULT << 1)     /**< Shifted mode DEFAULT for TXF_SWRST          */

/* Bit fields for TXF CONNECT */
#define _TXF_CONNECT_RESETVALUE                 0x00000000UL                            /**< Default value for TXF_CONNECT               */
#define _TXF_CONNECT_MASK                       0x00000001UL                            /**< Mask for TXF_CONNECT                        */
#define TXF_CONNECT_IN                          (0x1UL << 0)                            /**< Input FIFO connect                          */
#define _TXF_CONNECT_IN_SHIFT                   0                                       /**< Shift value for TXF_IN                      */
#define _TXF_CONNECT_IN_MASK                    0x1UL                                   /**< Bit mask for TXF_IN                         */
#define _TXF_CONNECT_IN_DEFAULT                 0x00000000UL                            /**< Mode DEFAULT for TXF_CONNECT                */
#define TXF_CONNECT_IN_DEFAULT                  (_TXF_CONNECT_IN_DEFAULT << 0)          /**< Shifted mode DEFAULT for TXF_CONNECT        */

/* Bit fields for TXF DISCLK */
#define _TXF_DISCLK_RESETVALUE                  0x00000000UL                            /**< Default value for TXF_DISCLK                */
#define _TXF_DISCLK_MASK                        0x00000001UL                            /**< Mask for TXF_DISCLK                         */
#define TXF_DISCLK_DISCLK                       (0x1UL << 0)                            /**< New BitField                                */
#define _TXF_DISCLK_DISCLK_SHIFT                0                                       /**< Shift value for TXF_DISCLK                  */
#define _TXF_DISCLK_DISCLK_MASK                 0x1UL                                   /**< Bit mask for TXF_DISCLK                     */
#define _TXF_DISCLK_DISCLK_DEFAULT              0x00000000UL                            /**< Mode DEFAULT for TXF_DISCLK                 */
#define TXF_DISCLK_DISCLK_DEFAULT               (_TXF_DISCLK_DISCLK_DEFAULT << 0)       /**< Shifted mode DEFAULT for TXF_DISCLK         */

/* Bit fields for TXF FIFOIN */
#define _TXF_FIFOIN_RESETVALUE                  0x00000000UL                            /**< Default value for TXF_FIFOIN                */
#define _TXF_FIFOIN_MASK                        0x1FFF3F0FUL                            /**< Mask for TXF_FIFOIN                         */
#define _TXF_FIFOIN_FID_SHIFT                   0                                       /**< Shift value for TXF_FID                     */
#define _TXF_FIFOIN_FID_MASK                    0xFUL                                   /**< Bit mask for TXF_FID                        */
#define _TXF_FIFOIN_FID_DEFAULT                 0x00000000UL                            /**< Mode DEFAULT for TXF_FIFOIN                 */
#define TXF_FIFOIN_FID_DEFAULT                  (_TXF_FIFOIN_FID_DEFAULT << 0)          /**< Shifted mode DEFAULT for TXF_FIFOIN         */
#define _TXF_FIFOIN_CID_SHIFT                   8                                       /**< Shift value for TXF_CID                     */
#define _TXF_FIFOIN_CID_MASK                    0x3F00UL                                /**< Bit mask for TXF_CID                        */
#define _TXF_FIFOIN_CID_DEFAULT                 0x00000000UL                            /**< Mode DEFAULT for TXF_FIFOIN                 */
#define TXF_FIFOIN_CID_DEFAULT                  (_TXF_FIFOIN_CID_DEFAULT << 8)          /**< Shifted mode DEFAULT for TXF_FIFOIN         */
#define _TXF_FIFOIN_REM_SHIFT                   16                                      /**< Shift value for TXF_REM                     */
#define _TXF_FIFOIN_REM_MASK                    0xFF0000UL                              /**< Bit mask for TXF_REM                        */
#define _TXF_FIFOIN_REM_DEFAULT                 0x00000000UL                            /**< Mode DEFAULT for TXF_FIFOIN                 */
#define TXF_FIFOIN_REM_DEFAULT                  (_TXF_FIFOIN_REM_DEFAULT << 16)         /**< Shifted mode DEFAULT for TXF_FIFOIN         */
#define _TXF_FIFOIN_ALARM_SHIFT                 24                                      /**< Shift value for TXF_ALARM                   */
#define _TXF_FIFOIN_ALARM_MASK                  0x1F000000UL                            /**< Bit mask for TXF_ALARM                      */
#define _TXF_FIFOIN_ALARM_DEFAULT               0x00000000UL                            /**< Mode DEFAULT for TXF_FIFOIN                 */
#define TXF_FIFOIN_ALARM_DEFAULT                (_TXF_FIFOIN_ALARM_DEFAULT << 24)       /**< Shifted mode DEFAULT for TXF_FIFOIN         */

/* Bit fields for TXF CTRL */
#define _TXF_CTRL_RESETVALUE                    0x00000002UL                            /**< Default value for TXF_CTRL                  */
#define _TXF_CTRL_MASK                          0x0000000FUL                            /**< Mask for TXF_CTRL                           */
#define TXF_CTRL_CONNECTFE                      (0x1UL << 0)                            /**< New BitField                                */
#define _TXF_CTRL_CONNECTFE_SHIFT               0                                       /**< Shift value for TXF_CONNECTFE               */
#define _TXF_CTRL_CONNECTFE_MASK                0x1UL                                   /**< Bit mask for TXF_CONNECTFE                  */
#define _TXF_CTRL_CONNECTFE_DEFAULT             0x00000000UL                            /**< Mode DEFAULT for TXF_CTRL                   */
#define TXF_CTRL_CONNECTFE_DEFAULT              (_TXF_CTRL_CONNECTFE_DEFAULT << 0)      /**< Shifted mode DEFAULT for TXF_CTRL           */
#define TXF_CTRL_DIFFENC                        (0x1UL << 1)                            /**< New BitField                                */
#define _TXF_CTRL_DIFFENC_SHIFT                 1                                       /**< Shift value for TXF_DIFFENC                 */
#define _TXF_CTRL_DIFFENC_MASK                  0x2UL                                   /**< Bit mask for TXF_DIFFENC                    */
#define _TXF_CTRL_DIFFENC_DEFAULT               0x00000001UL                            /**< Mode DEFAULT for TXF_CTRL                   */
#define _TXF_CTRL_DIFFENC_disabled              0x00000000UL                            /**< Mode disabled for TXF_CTRL                  */
#define _TXF_CTRL_DIFFENC_enabled               0x00000001UL                            /**< Mode enabled for TXF_CTRL                   */
#define TXF_CTRL_DIFFENC_DEFAULT                (_TXF_CTRL_DIFFENC_DEFAULT << 1)        /**< Shifted mode DEFAULT for TXF_CTRL           */
#define TXF_CTRL_DIFFENC_disabled               (_TXF_CTRL_DIFFENC_disabled << 1)       /**< Shifted mode disabled for TXF_CTRL          */
#define TXF_CTRL_DIFFENC_enabled                (_TXF_CTRL_DIFFENC_enabled << 1)        /**< Shifted mode enabled for TXF_CTRL           */
#define TXF_CTRL_IFSEL                          (0x1UL << 2)                            /**< New BitField                                */
#define _TXF_CTRL_IFSEL_SHIFT                   2                                       /**< Shift value for TXF_IFSEL                   */
#define _TXF_CTRL_IFSEL_MASK                    0x4UL                                   /**< Bit mask for TXF_IFSEL                      */
#define _TXF_CTRL_IFSEL_DEFAULT                 0x00000000UL                            /**< Mode DEFAULT for TXF_CTRL                   */
#define _TXF_CTRL_IFSEL_IQ                      0x00000000UL                            /**< Mode IQ for TXF_CTRL                        */
#define _TXF_CTRL_IFSEL_LEG                     0x00000001UL                            /**< Mode LEG for TXF_CTRL                       */
#define TXF_CTRL_IFSEL_DEFAULT                  (_TXF_CTRL_IFSEL_DEFAULT << 2)          /**< Shifted mode DEFAULT for TXF_CTRL           */
#define TXF_CTRL_IFSEL_IQ                       (_TXF_CTRL_IFSEL_IQ << 2)               /**< Shifted mode IQ for TXF_CTRL                */
#define TXF_CTRL_IFSEL_LEG                      (_TXF_CTRL_IFSEL_LEG << 2)              /**< Shifted mode LEG for TXF_CTRL               */
#define TXF_CTRL_DATEFORCECNT                   (0x1UL << 3)                            /**< New BitField                                */
#define _TXF_CTRL_DATEFORCECNT_SHIFT            3                                       /**< Shift value for TXF_DATEFORCECNT            */
#define _TXF_CTRL_DATEFORCECNT_MASK             0x8UL                                   /**< Bit mask for TXF_DATEFORCECNT               */
#define _TXF_CTRL_DATEFORCECNT_DEFAULT          0x00000000UL                            /**< Mode DEFAULT for TXF_CTRL                   */
#define TXF_CTRL_DATEFORCECNT_DEFAULT           (_TXF_CTRL_DATEFORCECNT_DEFAULT << 3)   /**< Shifted mode DEFAULT for TXF_CTRL           */

/* Bit fields for TXF DATE */
#define _TXF_DATE_RESETVALUE                    0x00000002UL                            /**< Default value for TXF_DATE                  */
#define _TXF_DATE_MASK                          0xFFFFFFFFUL                            /**< Mask for TXF_DATE                           */
#define _TXF_DATE_DATE_SHIFT                    0                                       /**< Shift value for TXF_DATE                    */
#define _TXF_DATE_DATE_MASK                     0xFFFFFFFFUL                            /**< Bit mask for TXF_DATE                       */
#define _TXF_DATE_DATE_DEFAULT                  0x00000002UL                            /**< Mode DEFAULT for TXF_DATE                   */
#define TXF_DATE_DATE_DEFAULT                   (_TXF_DATE_DATE_DEFAULT << 0)           /**< Shifted mode DEFAULT for TXF_DATE           */

/* Bit fields for TXF IF */
#define _TXF_IF_RESETVALUE                      0x00000000UL                            /**< Default value for TXF_IF                    */
#define _TXF_IF_MASK                            0x0000003FUL                            /**< Mask for TXF_IF                             */
#define TXF_IF_TXFIF0                           (0x1UL << 0)                            /**< TXF Interrupt Flag                          */
#define _TXF_IF_TXFIF0_SHIFT                    0                                       /**< Shift value for TXF_TXFIF0                  */
#define _TXF_IF_TXFIF0_MASK                     0x1UL                                   /**< Bit mask for TXF_TXFIF0                     */
#define _TXF_IF_TXFIF0_DEFAULT                  0x00000000UL                            /**< Mode DEFAULT for TXF_IF                     */
#define TXF_IF_TXFIF0_DEFAULT                   (_TXF_IF_TXFIF0_DEFAULT << 0)           /**< Shifted mode DEFAULT for TXF_IF             */
#define TXF_IF_TXFIF1                           (0x1UL << 1)                            /**< TXF Interrupt Flag                          */
#define _TXF_IF_TXFIF1_SHIFT                    1                                       /**< Shift value for TXF_TXFIF1                  */
#define _TXF_IF_TXFIF1_MASK                     0x2UL                                   /**< Bit mask for TXF_TXFIF1                     */
#define _TXF_IF_TXFIF1_DEFAULT                  0x00000000UL                            /**< Mode DEFAULT for TXF_IF                     */
#define TXF_IF_TXFIF1_DEFAULT                   (_TXF_IF_TXFIF1_DEFAULT << 1)           /**< Shifted mode DEFAULT for TXF_IF             */
#define TXF_IF_TXFIF2                           (0x1UL << 2)                            /**< TXF Interrupt Flag                          */
#define _TXF_IF_TXFIF2_SHIFT                    2                                       /**< Shift value for TXF_TXFIF2                  */
#define _TXF_IF_TXFIF2_MASK                     0x4UL                                   /**< Bit mask for TXF_TXFIF2                     */
#define _TXF_IF_TXFIF2_DEFAULT                  0x00000000UL                            /**< Mode DEFAULT for TXF_IF                     */
#define TXF_IF_TXFIF2_DEFAULT                   (_TXF_IF_TXFIF2_DEFAULT << 2)           /**< Shifted mode DEFAULT for TXF_IF             */
#define TXF_IF_TXFIF3                           (0x1UL << 3)                            /**< TXF Interrupt Flag                          */
#define _TXF_IF_TXFIF3_SHIFT                    3                                       /**< Shift value for TXF_TXFIF3                  */
#define _TXF_IF_TXFIF3_MASK                     0x8UL                                   /**< Bit mask for TXF_TXFIF3                     */
#define _TXF_IF_TXFIF3_DEFAULT                  0x00000000UL                            /**< Mode DEFAULT for TXF_IF                     */
#define TXF_IF_TXFIF3_DEFAULT                   (_TXF_IF_TXFIF3_DEFAULT << 3)           /**< Shifted mode DEFAULT for TXF_IF             */
#define TXF_IF_TXFIF4                           (0x1UL << 4)                            /**< TXF Interrupt Flag                          */
#define _TXF_IF_TXFIF4_SHIFT                    4                                       /**< Shift value for TXF_TXFIF4                  */
#define _TXF_IF_TXFIF4_MASK                     0x10UL                                  /**< Bit mask for TXF_TXFIF4                     */
#define _TXF_IF_TXFIF4_DEFAULT                  0x00000000UL                            /**< Mode DEFAULT for TXF_IF                     */
#define TXF_IF_TXFIF4_DEFAULT                   (_TXF_IF_TXFIF4_DEFAULT << 4)           /**< Shifted mode DEFAULT for TXF_IF             */
#define TXF_IF_TXFIF5                           (0x1UL << 5)                            /**< TXF Interrupt Flag                          */
#define _TXF_IF_TXFIF5_SHIFT                    5                                       /**< Shift value for TXF_TXFIF5                  */
#define _TXF_IF_TXFIF5_MASK                     0x20UL                                  /**< Bit mask for TXF_TXFIF5                     */
#define _TXF_IF_TXFIF5_DEFAULT                  0x00000000UL                            /**< Mode DEFAULT for TXF_IF                     */
#define TXF_IF_TXFIF5_DEFAULT                   (_TXF_IF_TXFIF5_DEFAULT << 5)           /**< Shifted mode DEFAULT for TXF_IF             */

/* Bit fields for TXF IEN */
#define _TXF_IEN_RESETVALUE                     0x00000000UL                            /**< Default value for TXF_IEN                   */
#define _TXF_IEN_MASK                           0x0000003FUL                            /**< Mask for TXF_IEN                            */
#define TXF_IEN_TXFIEN0                         (0x1UL << 0)                            /**< TXF Interrupt Enable                        */
#define _TXF_IEN_TXFIEN0_SHIFT                  0                                       /**< Shift value for TXF_TXFIEN0                 */
#define _TXF_IEN_TXFIEN0_MASK                   0x1UL                                   /**< Bit mask for TXF_TXFIEN0                    */
#define _TXF_IEN_TXFIEN0_DEFAULT                0x00000000UL                            /**< Mode DEFAULT for TXF_IEN                    */
#define TXF_IEN_TXFIEN0_DEFAULT                 (_TXF_IEN_TXFIEN0_DEFAULT << 0)         /**< Shifted mode DEFAULT for TXF_IEN            */
#define TXF_IEN_TXFIEN1                         (0x1UL << 1)                            /**< TXF Interrupt Enable                        */
#define _TXF_IEN_TXFIEN1_SHIFT                  1                                       /**< Shift value for TXF_TXFIEN1                 */
#define _TXF_IEN_TXFIEN1_MASK                   0x2UL                                   /**< Bit mask for TXF_TXFIEN1                    */
#define _TXF_IEN_TXFIEN1_DEFAULT                0x00000000UL                            /**< Mode DEFAULT for TXF_IEN                    */
#define TXF_IEN_TXFIEN1_DEFAULT                 (_TXF_IEN_TXFIEN1_DEFAULT << 1)         /**< Shifted mode DEFAULT for TXF_IEN            */
#define TXF_IEN_TXFIEN2                         (0x1UL << 2)                            /**< TXF Interrupt Enable                        */
#define _TXF_IEN_TXFIEN2_SHIFT                  2                                       /**< Shift value for TXF_TXFIEN2                 */
#define _TXF_IEN_TXFIEN2_MASK                   0x4UL                                   /**< Bit mask for TXF_TXFIEN2                    */
#define _TXF_IEN_TXFIEN2_DEFAULT                0x00000000UL                            /**< Mode DEFAULT for TXF_IEN                    */
#define TXF_IEN_TXFIEN2_DEFAULT                 (_TXF_IEN_TXFIEN2_DEFAULT << 2)         /**< Shifted mode DEFAULT for TXF_IEN            */
#define TXF_IEN_TXFIEN3                         (0x1UL << 3)                            /**< TXF Interrupt Enable                        */
#define _TXF_IEN_TXFIEN3_SHIFT                  3                                       /**< Shift value for TXF_TXFIEN3                 */
#define _TXF_IEN_TXFIEN3_MASK                   0x8UL                                   /**< Bit mask for TXF_TXFIEN3                    */
#define _TXF_IEN_TXFIEN3_DEFAULT                0x00000000UL                            /**< Mode DEFAULT for TXF_IEN                    */
#define TXF_IEN_TXFIEN3_DEFAULT                 (_TXF_IEN_TXFIEN3_DEFAULT << 3)         /**< Shifted mode DEFAULT for TXF_IEN            */
#define TXF_IEN_TXFIEN4                         (0x1UL << 4)                            /**< TXF Interrupt Enable                        */
#define _TXF_IEN_TXFIEN4_SHIFT                  4                                       /**< Shift value for TXF_TXFIEN4                 */
#define _TXF_IEN_TXFIEN4_MASK                   0x10UL                                  /**< Bit mask for TXF_TXFIEN4                    */
#define _TXF_IEN_TXFIEN4_DEFAULT                0x00000000UL                            /**< Mode DEFAULT for TXF_IEN                    */
#define TXF_IEN_TXFIEN4_DEFAULT                 (_TXF_IEN_TXFIEN4_DEFAULT << 4)         /**< Shifted mode DEFAULT for TXF_IEN            */
#define TXF_IEN_TXFIEN5                         (0x1UL << 5)                            /**< TXF Interrupt Enable                        */
#define _TXF_IEN_TXFIEN5_SHIFT                  5                                       /**< Shift value for TXF_TXFIEN5                 */
#define _TXF_IEN_TXFIEN5_MASK                   0x20UL                                  /**< Bit mask for TXF_TXFIEN5                    */
#define _TXF_IEN_TXFIEN5_DEFAULT                0x00000000UL                            /**< Mode DEFAULT for TXF_IEN                    */
#define TXF_IEN_TXFIEN5_DEFAULT                 (_TXF_IEN_TXFIEN5_DEFAULT << 5)         /**< Shifted mode DEFAULT for TXF_IEN            */

/* Bit fields for TXF FRAMELENGTH */
#define _TXF_FRAMELENGTH_RESETVALUE             0x00000000UL                                /**< Default value for TXF_FRAMELENGTH           */
#define _TXF_FRAMELENGTH_MASK                   0x0003FFFFUL                                /**< Mask for TXF_FRAMELENGTH                    */
#define _TXF_FRAMELENGTH_FRAMELENGTH_SHIFT      0                                           /**< Shift value for TXF_FRAMELENGTH             */
#define _TXF_FRAMELENGTH_FRAMELENGTH_MASK       0x3FFFFUL                                   /**< Bit mask for TXF_FRAMELENGTH                */
#define _TXF_FRAMELENGTH_FRAMELENGTH_DEFAULT    0x00000000UL                                /**< Mode DEFAULT for TXF_FRAMELENGTH            */
#define TXF_FRAMELENGTH_FRAMELENGTH_DEFAULT     (_TXF_FRAMELENGTH_FRAMELENGTH_DEFAULT << 0) /**< Shifted mode DEFAULT for TXF_FRAMELENGTH    */

