SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_txf.h
/* Bit fields for TXF ITCTRL */
#define _TXF_ITCTRL_RESETVALUE                  0x00000000UL                            /**< Default value for TXF_ITCTRL                */
#define _TXF_ITCTRL_MASK                        0x0000000FUL                            /**< Mask for TXF_ITCTRL                         */
#define TXF_ITCTRL_ITMODE                       (0x1UL << 0)                            /**< New BitField                                */
#define _TXF_ITCTRL_ITMODE_SHIFT                0                                       /**< Shift value for TXF_ITMODE                  */
#define _TXF_ITCTRL_ITMODE_MASK                 0x1UL                                   /**< Bit mask for TXF_ITMODE                     */
#define _TXF_ITCTRL_ITMODE_DEFAULT              0x00000000UL                            /**< Mode DEFAULT for TXF_ITCTRL                 */
#define _TXF_ITCTRL_ITMODE_reg                  0x00000000UL                            /**< Mode reg for TXF_ITCTRL                     */
#define _TXF_ITCTRL_ITMODE_timer                0x00000001UL                            /**< Mode timer for TXF_ITCTRL                   */
#define TXF_ITCTRL_ITMODE_DEFAULT               (_TXF_ITCTRL_ITMODE_DEFAULT << 0)       /**< Shifted mode DEFAULT for TXF_ITCTRL         */
#define TXF_ITCTRL_ITMODE_reg                   (_TXF_ITCTRL_ITMODE_reg << 0)           /**< Shifted mode reg for TXF_ITCTRL             */
#define TXF_ITCTRL_ITMODE_timer                 (_TXF_ITCTRL_ITMODE_timer << 0)         /**< Shifted mode timer for TXF_ITCTRL           */
#define TXF_ITCTRL_ITTIMERMODE                  (0x1UL << 1)                            /**< New BitField                                */
#define _TXF_ITCTRL_ITTIMERMODE_SHIFT           1                                       /**< Shift value for TXF_ITTIMERMODE             */
#define _TXF_ITCTRL_ITTIMERMODE_MASK            0x2UL                                   /**< Bit mask for TXF_ITTIMERMODE                */
#define _TXF_ITCTRL_ITTIMERMODE_DEFAULT         0x00000000UL                            /**< Mode DEFAULT for TXF_ITCTRL                 */
#define _TXF_ITCTRL_ITTIMERMODE_expired         0x00000000UL                            /**< Mode expired for TXF_ITCTRL                 */
#define _TXF_ITCTRL_ITTIMERMODE_equal           0x00000001UL                            /**< Mode equal for TXF_ITCTRL                   */
#define TXF_ITCTRL_ITTIMERMODE_DEFAULT          (_TXF_ITCTRL_ITTIMERMODE_DEFAULT << 1)  /**< Shifted mode DEFAULT for TXF_ITCTRL         */
#define TXF_ITCTRL_ITTIMERMODE_expired          (_TXF_ITCTRL_ITTIMERMODE_expired << 1)  /**< Shifted mode expired for TXF_ITCTRL         */
#define TXF_ITCTRL_ITTIMERMODE_equal            (_TXF_ITCTRL_ITTIMERMODE_equal << 1)    /**< Shifted mode equal for TXF_ITCTRL           */
#define TXF_ITCTRL_ITREG                        (0x1UL << 2)                            /**< New BitField                                */
#define _TXF_ITCTRL_ITREG_SHIFT                 2                                       /**< Shift value for TXF_ITREG                   */
#define _TXF_ITCTRL_ITREG_MASK                  0x4UL                                   /**< Bit mask for TXF_ITREG                      */
#define _TXF_ITCTRL_ITREG_DEFAULT               0x00000000UL                            /**< Mode DEFAULT for TXF_ITCTRL                 */
#define TXF_ITCTRL_ITREG_DEFAULT                (_TXF_ITCTRL_ITREG_DEFAULT << 2)        /**< Shifted mode DEFAULT for TXF_ITCTRL         */
#define TXF_ITCTRL_ITTRIG                       (0x1UL << 3)                            /**< New BitField                                */
#define _TXF_ITCTRL_ITTRIG_SHIFT                3                                       /**< Shift value for TXF_ITTRIG                  */
#define _TXF_ITCTRL_ITTRIG_MASK                 0x8UL                                   /**< Bit mask for TXF_ITTRIG                     */
#define _TXF_ITCTRL_ITTRIG_DEFAULT              0x00000000UL                            /**< Mode DEFAULT for TXF_ITCTRL                 */
#define _TXF_ITCTRL_ITTRIG_pulse                0x00000000UL                            /**< Mode pulse for TXF_ITCTRL                   */
#define _TXF_ITCTRL_ITTRIG_level                0x00000001UL                            /**< Mode level for TXF_ITCTRL                   */
#define TXF_ITCTRL_ITTRIG_DEFAULT               (_TXF_ITCTRL_ITTRIG_DEFAULT << 3)       /**< Shifted mode DEFAULT for TXF_ITCTRL         */
#define TXF_ITCTRL_ITTRIG_pulse                 (_TXF_ITCTRL_ITTRIG_pulse << 3)         /**< Shifted mode pulse for TXF_ITCTRL           */
#define TXF_ITCTRL_ITTRIG_level                 (_TXF_ITCTRL_ITTRIG_level << 3)         /**< Shifted mode level for TXF_ITCTRL           */

/* Bit fields for TXF DATEIT */
#define _TXF_DATEIT_RESETVALUE                  0x00000000UL                            /**< Default value for TXF_DATEIT                */
#define _TXF_DATEIT_MASK                        0xFFFFFFFFUL                            /**< Mask for TXF_DATEIT                         */
#define _TXF_DATEIT_DATEIT_SHIFT                0                                       /**< Shift value for TXF_DATEIT                  */
#define _TXF_DATEIT_DATEIT_MASK                 0xFFFFFFFFUL                            /**< Bit mask for TXF_DATEIT                     */
#define _TXF_DATEIT_DATEIT_DEFAULT              0x00000000UL                            /**< Mode DEFAULT for TXF_DATEIT                 */
#define TXF_DATEIT_DATEIT_DEFAULT               (_TXF_DATEIT_DATEIT_DEFAULT << 0)       /**< Shifted mode DEFAULT for TXF_DATEIT         */

/* Bit fields for TXF ITSIG */
#define _TXF_ITSIG_RESETVALUE                   0x00000000UL                            /**< Default value for TXF_ITSIG                 */
#define _TXF_ITSIG_MASK                         0x00000001UL                            /**< Mask for TXF_ITSIG                          */
#define TXF_ITSIG_ITSIG                         (0x1UL << 0)                            /**< New BitField                                */
#define _TXF_ITSIG_ITSIG_SHIFT                  0                                       /**< Shift value for TXF_ITSIG                   */
#define _TXF_ITSIG_ITSIG_MASK                   0x1UL                                   /**< Bit mask for TXF_ITSIG                      */
#define _TXF_ITSIG_ITSIG_DEFAULT                0x00000000UL                            /**< Mode DEFAULT for TXF_ITSIG                  */
#define TXF_ITSIG_ITSIG_DEFAULT                 (_TXF_ITSIG_ITSIG_DEFAULT << 0)         /**< Shifted mode DEFAULT for TXF_ITSIG          */

/** @} End of group EFR32FG25_TXF_BitFields */
/** @} End of group EFR32FG25_TXF */
/** @} End of group Parts */

#endif /* EFR32FG25_TXF_H */
